### SQL Challenges

The core SQL challenges consist of the activities at the end of the SQL lab.  
http://www.w3schools.com/sql/trysql.asp?filename=trysql_select_all  

You can run the queries in W3 schools and include your work in a markdown file (exercise number, question, SQL query, result of query)

---

**Challenge 0 - Practice Example**

What customers are from Sweden?

```sql
SELECT * FROM Customers WHERE Country='Sweden';
```

>Berglunds snabbköp  |Christina Berglund  
Folk och fä HB  |Maria Larsson

**Challenge 1**

What customers are from the UK?

```
SELECT * FROM Customers WHERE Country='UK';
```
CustomerID|CustomerName|ContactName|Address|City|PostalCode|Country
---|---|---|---|---|---|---
4|Around the Horn|Thomas Hardy|120 Hanover Sq.|London|WA1 1DP|UK  
11|B's Beverages|Victoria Ashworth|Fauntleroy Circus|London|EC2 5NT|UK  
16|Consolidated Holdings|Elizabeth Brown|Berkeley Gardens 12 Brewery|London|WX1 6LT|UK  
19|Eastern Connection|Ann Devon|35 King George|London|WX3 6FW|UK  
38|Island Trading|Helen Bennett|Garden House Crowther Way|Cowes|PO31 7PJ|UK  
53|North/South|Simon Crowther|South House 300 Queensbridge|London|SW7 1RZ|UK  
72|Seven Seas Imports|Hari Kumar|90 Wadhurst Rd.|London|OX15 4NB|UK

**Challenge 2**

What is the name of the customer who has the most orders?

```SELECT Customers.CustomerName, COUNT(DISTINCT OrderID) as ct FROM Orders
LEFT JOIN Customers ON Orders.CustomerID==Customers.CustomerID
GROUP BY Orders.CustomerId ORDER BY ct DESC
LIMIT 1;```

CustomerName|ct
---|---
Ernst Handel|10

**Challenge 3**

What supplier has the highest average product price?

```
SELECT SupplierName, AVG(p.Price) as av FROM Products as p  
LEFT JOIN Suppliers as s  
ON p.SupplierID = s.SupplierID  
GROUP BY p.SupplierID  
ORDER BY av DESC  
LIMIT 1;  
```

>SupplierName|av  
Aux joyeux ecclésiastiques|140.75

**Challenge 4**

How many different countries are their customers from? (Hint: Consider DISTINCT.)

```
SELECT DISTINCT Country FROM [Customers]
```

> Number of Records: 21

**Challenge 5**

What category appears the most in order details?

```
SELECT c.CategoryName, COUNT(*) as ct FROM OrderDetails as o
LEFT JOIN Products as p ON o.ProductID = p.ProductID
LEFT JOIN Categories as c on p.CategoryID = c.CategoryId
GROUP BY p.CategoryID
ORDER BY ct DESC
LIMIT 1;
```

> CategoryName|ct  
Dairy Products|100

**Challenge 6**

What was the total cost for each order?

```
SELECT o.OrderID, sum(p.Price) as total_cost FROM OrderDetails as o
LEFT JOIN Products as p ON o.ProductID = p.ProductID
GROUP BY o.OrderID
LIMIT 5;
```

> OrderID|total_cost  
10248|69.8  
10249|76.25  
10250|83.7  
10251|61.55  
10252|117.5

**Challenge 7**

What employee made the most sales (by total cost)?

```
SELECT e.employeeID, e.Lastname, e.FirstName, sum(p.Price) as total_sales FROM OrderDetails as od
LEFT JOIN Products as p ON od.ProductID = p.ProductID
LEFT JOIN Orders as o ON od.OrderID = o.OrderID
LEFT JOIN Employees as e on o.EmployeeID = e.EmployeeID
GROUP BY e.EmployeeID;
```

> EmployeeID|LastName|FirstName|total_sales  
1|Davolio|Nancy|2393.6800000000003  
2|Fuller|Andrew|1215.1499999999999  
3|Leverling|Janet|1765.8100000000004  
4|Peacock|Margaret|3887.22  
5|Buchanan|Steven|873.8999999999999  
6|Suyama|Michael|1181.4999999999998  
7|King|Robert|1216.25  
8|Callahan|Laura|2172.17  
9|Dodsworth|Anne|424.68999999999994

**Challenge 8**

What employees have BS degrees? (Hint: Look at the LIKE operator.)

```
SELECT * FROM Employees
WHERE Notes LIKE '%BS%';
```

> |EmployeeID|LastName|FirstName|BirthDate|Photo|Notes|
|---|---|---|---|---|---|
|3|Leverling|Janet|1963-08-30|EmpID3.pic|Janet has a BS degree in chemistry from Boston College). She has also completed a certificate program in food retailing management. Janet was hired as a sales associate and was promoted to sales representative.|
|5|Buchanan|Steven|1955-03-04|EmpID5.pic|Steven Buchanan graduated from St. Andrews University, Scotland, with a BSC degree. Upon joining the company as a sales representative, he spent 6 months in an orientation program at the Seattle office and then returned to his permanent post in London, where he was promoted to sales manager. Mr. Buchanan has completed the courses 'Successful Telemarketing' and 'International Sales Management'. He is fluent in French.|

**Challenge 9**

What supplier of three or more products has the highest average product price? (Hint: Look at the HAVING operator.)

```
SELECT SupplierName, AVG(p.Price) as av, COUNT(p.ProductID) as ct FROM Products as p  
LEFT JOIN Suppliers as s  
ON p.SupplierID = s.SupplierID  
GROUP BY p.SupplierID
HAVING ct > 2
ORDER BY av DESC
LIMIT 3; 
```

> SupplierName	av	ct  
Tokyo Traders	46	3  
Plutzer Lebensmittelgroßmärkte AG	44.678000000000004	5  
Pavlova, Ltd.	35.57	5